LES_keqTurbBoundary_value_clean/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    down
    {
        type            symmetry;
    }

    right	// outlet
    {
        type            advective;
        value           $internalField;
    }

    up
    {
        type            symmetry;
    }

    left	// inlet, value copied from incompressible/pimpleFoam/LES/planeChannel
    {
        type            turbulentDFSEMInlet;
        delta           1;
        U
        {
            type        mappedFile;
            mapMethod   nearest;
        }
        R
        {
            type        mappedFile;
            mapMethod   nearest;
        }
        L
        {
            type        mappedFile;
            mapMethod   nearest;
        }

        d               1;
        nCellPerEddy    1;
        scale           1;
        value           $internalField;
    }

    cylinder
    {
        type            noSlip;
    }
    
    frontAndBack
    {
        type            symmetry;
    }
    

    defaultFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
